---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeFileFailures
source: html/e4d15c83-d88b-4c73-40c4-aa82e82e0580.htm
---
# BuiltInFailures.KeyBasedTreeFileFailures Properties

Cannot open file [FileName].